In [1]:
import pandas as pd
import numpy as np

In [2]:
sozluk1 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
          "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
          "Kalori" : [123,145,235,567]}

In [3]:
dataFrame1 = pd.DataFrame(sozluk1,index = [0,1,2,3])

In [4]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     123
1  Mehmet      Yüzme     145
2  Zeynep       Koşu     235
3    Atıl  Basketbol     567

In [5]:
sozluk2 = {"Isim" : ["Osman","Levent","Atlas","Fatma"],
          "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"],
          "Kalori" : [223,345,535,667]}

In [7]:
dataFrame2 = pd.DataFrame(sozluk2,index = [4,5,6,7])

In [8]:
sozluk3 = {"Isim" : ["Ayşe","Mahmut","Duygu","Nur"],
          "Spor" : ["Koşu","Yüzme","Tenis","Voleybol"],
          "Kalori" : [223,345,535,667]}

In [9]:
dataFrame3 = pd.DataFrame(sozluk3,index = [8,9,10,11])

In [10]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Koşu     223
5  Levent      Yüzme     345
6   Atlas       Koşu     535
7   Fatma  Basketbol     667

In [11]:
dataFrame3

      Isim      Spor  Kalori
8     Ayşe      Koşu     223
9   Mahmut     Yüzme     345
10   Duygu     Tenis     535
11     Nur  Voleybol     667

## concatenation

In [13]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis = 0)

      Isim       Spor  Kalori
0    Ahmet       Koşu     123
1   Mehmet      Yüzme     145
2   Zeynep       Koşu     235
3     Atıl  Basketbol     567
4    Osman       Koşu     223
5   Levent      Yüzme     345
6    Atlas       Koşu     535
7    Fatma  Basketbol     667
8     Ayşe       Koşu     223
9   Mahmut      Yüzme     345
10   Duygu      Tenis     535
11     Nur   Voleybol     667

## merge

In [14]:
mergeSozluk1 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
               "Spor" : ["Koşu","Yüzme","Koşu","Basketbol"]}

In [15]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [16]:
mergeDataFrame1

     Isim       Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [17]:
mergeSozluk2 = {"Isim" : ["Ahmet","Mehmet","Zeynep","Atıl"],
               "Kalori" : [234,235,467,767]}

In [18]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [19]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet     234
1  Mehmet     235
2  Zeynep     467
3    Atıl     767

In [20]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

     Isim       Spor  Kalori
0   Ahmet       Koşu     234
1  Mehmet      Yüzme     235
2  Zeynep       Koşu     467
3    Atıl  Basketbol     767

In [21]:
maasSozluk = {"Isim" : ["Atıl","Zeynep","Mehmet","Ahmet"],
             "Departman" : ["Yazılım","Satış","Pazarlama","Yazılım"],
             "Maas" : [234,345,346,757]}

In [22]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [23]:
maasDataFrame

     Isim  Departman  Maas
0    Atıl    Yazılım   234
1  Zeynep      Satış   345
2  Mehmet  Pazarlama   346
3   Ahmet    Yazılım   757

In [25]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [26]:
maasDataFrame["Departman"].nunique()

3

In [27]:
maasDataFrame["Departman"].value_counts()

Departman
Yazılım      2
Satış        1
Pazarlama    1
Name: count, dtype: int64

In [29]:
def bruttenNete(maas) :
    return maas * 0.66

In [30]:
maasDataFrame["Maas"].apply(bruttenNete)

0    154.44
1    227.70
2    228.36
3    499.62
Name: Maas, dtype: float64

In [31]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [43]:
yeniBirVeri = {"Karakter Sınıf" : ["South Park", "South Park", "Simpson", "Simpson","Simpson"],
              "Karakter Ismi" : ["Cartman", "Kenny", "Homer", "Bart","Bart"],
              "Karakter Yas" : [6,12,45,57,23]}

In [44]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [45]:
karakterDF

  Karakter Sınıf Karakter Ismi  Karakter Yas
0     South Park       Cartman             6
1     South Park         Kenny            12
2        Simpson         Homer            45
3        Simpson          Bart            57
4        Simpson          Bart            23

In [46]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıf", "Karakter Ismi"])

                              Karakter Yas
Karakter Sınıf Karakter Ismi
Simpson        Bart                   40.0
               Homer                  45.0
South Park     Cartman                 6.0
               Kenny                  12.0

In [47]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıf", "Karakter Ismi"],aggfunc=np.sum)

C:\Users\maytemur\AppData\Local\Temp\ipykernel_12508\954744810.py:1: FutureWarning: The provided callable <function sum at 0x0000027869B54040> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıf", "Karakter Ismi"],aggfunc=np.sum)

                              Karakter Yas
Karakter Sınıf Karakter Ismi
Simpson        Bart                     80
               Homer                    45
South Park     Cartman                   6
               Kenny                    12